#pragma once
//=============================================================================
// 背景描画『enemy.h』
// 制作者:松本恵太
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemy(void);	//初期化
void UninitEnemy(void);		//修了
void UpdateEnemy(void);		//更新
void DrawEnemy(void);		//描画
int CollisionEnemy(XMFLOAT2 vCenter, XMFLOAT2 vBBox, float fDamage);//当たり(衝突)判定