#pragma once
//=============================================================================
// 背景描画『enemy2.h』
// 制作者:松本恵太
//=============================================================================
#pragma once
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitEnemy2(void);	//初期化
void UninitEnemy2(void);	//修了
void UpdateEnemy2(void);	//更新
void DrawEnemy2(void);		//描画
int CollisionEnemy2(XMFLOAT2 vCenter, XMFLOAT2 vBBox, float fDamage);//当たり(衝突)判定
