#pragma once
//=============================================================================
// フェードイン、フェードアウト専用コード『fade.h』
// 制作者:松本恵太
//=============================================================================

//*****************************************************************************
//インクルードガード(#include)
//*****************************************************************************
#include "scene.h"


//*****************************************************************************
//列挙体定義(enum)
//*****************************************************************************
enum EFade
{
	FADE_NONE = 0,	// 何もしていない状態
	FADE_IN,		// フェードイン処理中
	FADE_OUT,		// フェードアウト処理中
	MAX_FADE
};

//*****************************************************************************
//プロトタイプ宣言(関数呼びだし)
//*****************************************************************************
HRESULT InitFade();					// 初期化
void UninitFade();					// 終了処理
void UpdateFade();					// 更新
void DrawFade();					// 描画
void StartFadeOut(EScene eNext);	// フェードアウト開始
EFade GetFade();					// 状態取得
void SetFadeColor(float fR, float fG, float fB); // フェードアウト色設定