
#ifndef _GAMEOVER_H_
#define _GAMEOVER_H_
//=============================================================================
// タイトル画面『gameover.h』
// 制作者:松本恵太
//=============================================================================

//*****************************************************************************
//インクルードガード(#include)
//*****************************************************************************
#include "main.h"

// クラス定義(class)
class CGameover
{
public:
	HRESULT Init();	// 初期化処理
	void Uninit();	// 終了処理
	void Update();	// 更新処理
	void Draw();	// 描画処理

private:
	int m_Timer;	// タイムカウンター用
};


#endif // !_GAMEOVER_H_


