#ifndef _GAME_H_
#define _GAME_H_

//=============================================================================
// タイトル画面『game.h』
// 制作者:松本 恵太
//=============================================================================

//*****************************************************************************
//インクルードガード(#include)
//*****************************************************************************
#include "main.h"

// クラス定義(class)
class CGame 
{
public:
	// メンバ関数の呼び出し
	HRESULT Init();	// 初期化処理
	void Uninit();	// 終了処理
	void Update();	// 更新処理
	void Draw();	// 描画処理

private:
	bool m_bPause;	// ポーズしてるかのフラグ管理用

};

#endif // !_GAME_H_

