
#ifndef _NUMBER_H_
#define _NUMBER_H_
//=============================================================================
// ナンバー専用コード『number.h』
// 制作者:松本恵太
//=============================================================================

//*****************************************************************************
//インクルードガード(#include)
//*****************************************************************************
#include "main.h"


//*****************************************************************************
// マクロ定義(#define)
//*****************************************************************************
#define NUMBER_SIZE_X 35.0f			// 文字列
#define NUMBER_SIZE_Y 50.0f			// 文字列の高さ

// クラス定義(class)
class CNumber
{
public:
	HRESULT Init();
	void Uninit();
	void Draw(XMFLOAT2 vPos,		//表示する位置
		unsigned uNumber,	//表示する数値
		int nWidth,			//表示する桁数
		float fSizeX = NUMBER_SIZE_X,//1文字の幅
		float fSizeY = NUMBER_SIZE_Y);//1文字の高さ
private:
	
};

#endif // _NUMBER_H_
