#pragma once
//=============================================================================
// プレイヤー表示処理 [player.h]
// 制作者:松本恵太
//=============================================================================
#pragma once
#include "main.h"
//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitPlayer(void);
void UninitPlayer(void);
void UpdatePlayer(void);
void DrawPlayer(void);

bool IsGameOver();	//ゲームオーバー