#pragma once
//=============================================================================
// シーン用のコード『scene.h』
// 制作者:松本恵太
//=============================================================================

//=============================================================================
// インクルードガード(#include)
//=============================================================================
#include "main.h"

//=============================================================================
// 列挙体定義(enum)
//=============================================================================
enum EScene
{
	SCENE_NOME = 0,		//未設定
	SCENE_TITLE,		//タイトル画面
	SCENE_GAME,			//ゲーム画面
	SCENE_GAMEOVER,		//ゲームオーバー画面

	MAX_SCENE
};

// 関数プロトタイプ
HRESULT InitScene();	//初期化
void UninitScene();		//終了
void UpdateScene();		//更新
void DrawScene();		//描画

void SetScene(EScene eScene);	//画面切り替え